Revit 2024 API
BaseExportOptions.HideScopeBox Property
 Whether or not to hide the scope box. Default value is false.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool HideScopeBox { get; set; }
Visual Basic
Public Property HideScopeBox As Boolean
	Get
	Set
Visual C++
public:
property bool HideScopeBox {
	bool get ();
	void set (bool value);
}
See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace